// Pushbutton that says "Install 32 Items"
"installButtonLabelTemplatePlural" = "Installa %d elementi";

// Pushbutton that says "Install 1 Item"
"installButtonLabelTemplateSingular" = "Installa %d elemento";

// Pushbutton for zero items
"installButtonLabelTemplateZero" = "Installa";

// Abbreviation for megabytes
"size-mb-unit" = "MB";

// Abbreviation for kilobytes
"size-kb-unit" = "KB";

// Format for file size, like "37 MB" or "182.31 KB"
"size-string-format" = "%.1f %@";


// Strings for the "Products require reboot" dialog

// Reboot alert, shown if the user needs to restart their system.
"reboot-message" = "Google Software Update ti consiglia di riavviare il computer.";
// Reboot message specifying which software product might not work until a reboot.
"reboot-details" = "%1$@ potrebbe non funzionare correttamente se non riavvii il computer.";
// Default button, reboot now
"reboot-button1" = "Riavvia";
// Cancel button - do it later
"reboot-button2" = "Più tardi";
// Alert icon name.
// This message does not need to be translated.
"reboot-iconName" = "error";
// If there is no name for the product wanting a reboot, this string will
// be substituted into into |reboot-details|.
"reboot-no-product-placeholder" = "Software aggiornato di recente";

// "All done with update" alert message - The updates were successful
"alldone-success-message" = "Aggiornamenti riusciti";
// All-done message saying that the software has successfully finished installing
"alldone-success-details" = "Google Software Update ha terminato l'installazione degli aggiornamenti.";
// OK Button, updates were successful.
"alldone-success-button1" = "OK";
// Alert icon name.
// This message does not need to be translated.
"alldone-success-iconName" = "success";

// "Unsuccessful update" alert message - All of the updates were not successful.
"alldone-failure-message" = "Aggiornamenti non riusciti";
// Unsuccessful update message saying the update was not successful, and we'll try again at a later time.
"alldone-failure-details" = "Google Software Update non è riuscito a installare gli aggiornamenti. Ci riproverà più tardi.";
// OK button, updates were not successful.
"alldone-failure-button1" = "OK";
// Alert icon name.
// This message does not need to be translated.
"alldone-failure-iconName" = "error";

// "Partial Success", some updates succeeded, and some failed.
"alldone-mixed-message" = "Alcuni aggiornamenti riusciti";
// Partial success alert message, some updates were successful, some failed and will be tried later.
"alldone-mixed-details" = "Google Software Update ha terminato l'installazione di alcuni aggiornamenti. Gli aggiornamenti non riusciti verranno riavviati più tardi.";
// OK button
"alldone-mixed-button1" = "OK";
// Alert icon name.
// This message does not need to be translated.
"alldone-mixed-iconName" = "error";


// Strings for labels in the Google Software Update window.
// Some of these strings are referenced in
// KSAgentUpdateWindowControllerTest.m, so you may need to update the
// test if you change these.

// Title for the software Update Window.  This is the name of the "Google Software Update" product
"updatewindowTitle" = "Google Software Update";
// Update Window message saying that there are new google software updates available.
"updatewindowMessageLabel" = "È disponibile nuovo software Google per il tuo computer.";
// Update Window details line telling the user that if they don't install the updates now, they will be asked again sometime later.
"updatewindowDetailsLabel" = "Se ora non sei pronto per l'installazione, ti verrà chiesto di nuovo più tardi.";
// Update Window label that is shown if any updates require a restart.
"updatewindowRestartRequiredLabel" = "Sarà necessario riavviare il computer.";
// Update Window button label, acts as a cancel button, so that the user can update things later.
"updatewindowLaterButtonMessageLabel" = "Più tardi";
// Empty string for a table column for the restart icon.  It can stay empty.
// This message does not need to be translated.
"updatewindowTablecolumnRestartLabel" = "";
// Update Window table column header for checkboxes for the user to select/deselect.  If the checkbox is selected, the update will be installed.
"updatewindowTablecolumnInstallLabel" = "Installa";
// Update Window table column header for the name of the product being updated.
"updatewindowTablecolumnNameLabel" = "Nome";
// Update Window table column header for the version number of the product being updated.
"updatewindowTablecolumnVersionLabel" = "Versione";
// Update Window table column header for the download size of the product being updated.
"updatewindowTablecolumnSizeLabel" = "Dimensione";
// Update Window label above a progress indicator indicating which product name is being updated..
"updatewindowInstallingProductTemplate" = "Aggiornamento di %@";
// Update Window label saying that installation is in progress.
"updatewindowInstallingStatusLabel" = "Installazione in corso";


// Strings for the status menu items.  Set this as the title of the
// menu item in Interface Builder, and then the menu is localized
// at runtime.

// Status menu item letting the user bring the software update window to the front.
"raiseWindow" = "Porta in primo piano la finestra di Google Software Update";
// Status menu item letting the user check for updates immediately.
"checkForUpdates" = "Cerca aggiornamenti";
// Status menu item text which is used when Google Software Update is actually checking for updates.  This is a disabled menu item title
"checkingForUpdates" = "Ricerca aggiornamenti in corso";
